fras/tm4c1294-hw-demo/Firmware/hw_demo.c
    return 0;
}



// Read values from the TMP006 temperature sensor on the Educational
// BoosterPack MK II.
int TemperatureRead(char *pcCmd, char *pcParam)
{
    float fTemp;
    uint32_t ui32Tmp006ManufacturerId;
    uint32_t ui32Tmp006DeviceId;
    int iCnt;

    if (pcParam == NULL) {
        iCnt = 1;
    } else {
        iCnt = strtoul(pcParam, (char **) NULL, 0) & 0xffffff;
    }

    for (int i = 0; i < iCnt; i++) {
        fTemp = I2CTmp006ReadTemp(&g_sI2C2, EDUMKII_I2C_TMP006_SLV_ADR);
        ui32Tmp006ManufacturerId = I2CTmp006ReadManufacturerId(&g_sI2C2, EDUMKII_I2C_TMP006_SLV_ADR);
        ui32Tmp006DeviceId = I2CTmp006ReadDeviceId(&g_sI2C2, EDUMKII_I2C_TMP006_SLV_ADR);
        if ((ui32Tmp006ManufacturerId == ~0) || (ui32Tmp006DeviceId == ~0)) {
            UARTprintf("%s: Cannot read from the TMP006 IC.", UI_STR_ERROR);
            return -1;
        } else {
            UARTprintf("%s: Temperature = %s%d.%05d *C ; Manufacturer ID = 0x%04x ; Device ID = 0x%04x",
                        UI_STR_OK,
                        fTemp < 0 ? "-" : "", (int) abs(fTemp), (int) abs((fTemp - (int) fTemp) * 100000),
                        ui32Tmp006ManufacturerId, ui32Tmp006DeviceId);
        }
        if (i < iCnt - 1) {
            SysCtlDelay(1000000);
            UARTprintf("\n");
        }
    }

    return 0;
}



// Read values from the OPT3001 ambient light sensor on the Educational
// BoosterPack MK II.
int IlluminanceRead(char *pcCmd, char *pcParam)
{
    float fIlluminance;
    uint32_t ui32Opt3001ManufacturerId;
    uint32_t ui32Opt3001DeviceId;
    int iCnt;

    if (pcParam == NULL) {
        iCnt = 1;
    } else {
        iCnt = strtoul(pcParam, (char **) NULL, 0) & 0xffffff;
    }

    for (int i = 0; i < iCnt; i++) {
        fIlluminance = I2COpt3001ReadIlluminance(&g_sI2C2, EDUMKII_I2C_OPT3001_SLV_ADR);
        ui32Opt3001ManufacturerId = I2COpt3001ReadManufacturerId(&g_sI2C2, EDUMKII_I2C_OPT3001_SLV_ADR);
        ui32Opt3001DeviceId = I2COpt3001ReadDeviceId(&g_sI2C2, EDUMKII_I2C_OPT3001_SLV_ADR);
        if ((ui32Opt3001ManufacturerId == ~0) || (ui32Opt3001DeviceId == ~0)) {
            UARTprintf("%s: Cannot read from the OPT3001 IC.", UI_STR_ERROR);
            return -1;
        } else {
            UARTprintf("%s: Illuminance = %d.%02d lux ; Manufacturer ID = 0x%04x ; Device ID = 0x%04x",
                        UI_STR_OK,
                        (int) abs(fIlluminance), (int) abs((fIlluminance - (int) fIlluminance) * 100),
                        ui32Opt3001ManufacturerId, ui32Opt3001DeviceId);
        }
        if (i < iCnt - 1) {
            SysCtlDelay(1000000);
            UARTprintf("\n");
        }
    }

    return 0;
}



// SSI access.
int SsiAccess(char *pcCmd, char *pcParam)
{
    int i;
    uint8_t ui8SsiPort = 0;
    uint8_t ui8SsiRw = 0;   // 0 = write; 1 = read
    uint8_t ui8SsiDataNum = 0;
    uint32_t pui32SsiData[32];
    tSSI *psSsi;
    int32_t i32SsiStatus;
    // Parse parameters.
    for (i = 0; i < sizeof(pui32SsiData) / sizeof(pui32SsiData[0]); i++) {
        if (i != 0) pcParam = strtok(NULL, UI_STR_DELIMITER);
        if (i == 0) {
            if (pcParam == NULL) {
                UARTprintf("%s: SSI port number required after command `%s'.", UI_STR_ERROR, pcCmd);
                break;
            } else {
                ui8SsiPort = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0xff;
            }
        } else if (i == 1) {
            if (pcParam == NULL) {
                UARTprintf("%s: SSI read/write required after command `%s'.", UI_STR_ERROR, pcCmd);
                break;
            } else {
                ui8SsiRw = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0x01;
            }
        } else {
            if (i == 2 && ui8SsiRw == 0 && pcParam == NULL) {
                UARTprintf("%s: At least one data byte required after SSI write command `%s'.", UI_STR_ERROR, pcCmd);
                return -1;
            }
            if (pcParam == NULL) break;
            else pui32SsiData[i-2] = (uint8_t) strtoul(pcParam, (char **) NULL, 0) & 0xff;
        }
    }
    if (i < 2) return -1;
    // Check if the SSI port number is valid.
    switch (ui8SsiPort) {
        case 2: psSsi = &g_sSsi2; break;
        case 3: psSsi = &g_sSsi3; break;
        default:
            UARTprintf("%s: Only SSI port numbers 2 and 3 are supported!", UI_STR_ERROR);
            return -1;
    }
    // SSI write.
    if (ui8SsiRw == 0) {
        i32SsiStatus = SsiMasterWrite(psSsi, pui32SsiData, i - 2);
        // Check the SSI status.
        if (i32SsiStatus) {
            UARTprintf("%s: Error status from the SSI master %d: %d", UI_STR_ERROR, ui8SsiPort, i32SsiStatus);
        } else {
            UARTprintf("%s.", UI_STR_OK);
        }
    // SSI read.
    } else {
        // Read all available data.
        if (i == 2) {
            for (int iCnt = 0; ; iCnt++) {
                i32SsiStatus = SsiMasterRead(psSsi, pui32SsiData, 1);
                if (i32SsiStatus != 1) {
                    if (iCnt == 0) UARTprintf("%s: No data available.", UI_STR_ERROR);
                    break;
                } else {
                    if (iCnt == 0) UARTprintf("%s. Data:", UI_STR_OK);
                    UARTprintf(" 0x%02x", pui32SsiData[0]);
                }
            }
        // Read given number of data.
        } else {
             ui8SsiDataNum = pui32SsiData[0];
            if (ui8SsiDataNum > sizeof(pui32SsiData) / sizeof(pui32SsiData[0])) {
                ui8SsiDataNum = sizeof(pui32SsiData) / sizeof(pui32SsiData[0]);
            }
            i32SsiStatus = SsiMasterRead(psSsi, pui32SsiData, ui8SsiDataNum);
            // Check the SSI status.
            if (i32SsiStatus != ui8SsiDataNum) {
                UARTprintf("%s: Could only read %d data bytes from the SSI master %d instead of %d.", UI_STR_ERROR, i32SsiStatus, ui8SsiPort, ui8SsiDataNum);
            } else {
                UARTprintf("%s.", UI_STR_OK);
            }
            if (i32SsiStatus > 0) {
                UARTprintf(" Data:");
                for (i = 0; i < i32SsiStatus; i++) UARTprintf(" 0x%02x", pui32SsiData[i]);
            }
        }
    }

